too1/nrf52-ble-pong-central/main.c
};

/**@brief Connection parameters requested for connection. */
static ble_gap_conn_params_t const m_connection_param =
{
    (uint16_t)MIN_CONNECTION_INTERVAL,
    (uint16_t)MAX_CONNECTION_INTERVAL,
    (uint16_t)SLAVE_LATENCY,
    (uint16_t)SUPERVISION_TIMEOUT
};


/**@brief Function to handle asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num     Line number of the failing ASSERT call.
 * @param[in] p_file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(0xDEADBEEF, line_num, p_file_name);
}


/**@brief Function for the LEDs initialization.
 *
 * @details Initializes all LEDs used by the application.
 */
static void leds_init(void)
{
    bsp_board_init(BSP_INIT_LEDS);
}


/**@brief Function to start scanning. */
static void scan_start(void)
{
    ret_code_t ret;

    (void) sd_ble_gap_scan_stop();

    NRF_LOG_INFO("Start scanning for device name %s.", (uint32_t)m_target_periph_name);
    ret = sd_ble_gap_scan_start(&m_scan_params, &m_scan_buffer);
    APP_ERROR_CHECK(ret);
    // Turn on the LED to signal scanning.
    bsp_board_led_on(CENTRAL_SCANNING_LED);
}

static uint16_t thingy_under_discovery_conn_handle = 0xFFFF;

static void thingy_service_discovered(uint32_t service_mask)
{
    static uint32_t registered_masks[NRF_SDH_BLE_CENTRAL_LINK_COUNT] = {0};
    if(thingy_under_discovery_conn_handle < NRF_SDH_BLE_CENTRAL_LINK_COUNT)
    {
        registered_masks[thingy_under_discovery_conn_handle] |= service_mask;
        if(registered_masks[thingy_under_discovery_conn_handle] == THINGY_SERVICE_ALL_MASKS)
        {
            // All the services are discovered, which means the thingy is ready for use
            NRF_LOG_INFO("YAY");
            
            if (ble_conn_state_central_conn_count() == NRF_SDH_BLE_CENTRAL_LINK_COUNT)
            {
                bsp_board_led_off(CENTRAL_SCANNING_LED);
            }
            else
            {
                // Resume scanning.
                bsp_board_led_on(CENTRAL_SCANNING_LED);
                scan_start();
            }
            registered_masks[thingy_under_discovery_conn_handle] = 0;
            
            // Set up the Thingy for use here
            ble_thingy_tms_c_euler_notif_enable(&m_thingy_tms_c[thingy_under_discovery_conn_handle]);
            app_pong_controller_status_change(thingy_under_discovery_conn_handle, CONSTATE_ACTIVE);
            ble_thingy_uis_c_button_notif_enable(&m_thingy_uis_c[thingy_under_discovery_conn_handle]);
            ble_thingy_tss_config_send(&m_thingy_tss_c[thingy_under_discovery_conn_handle], 
                                                TSS_CONFIG_SPEAKER_MODE_SAMPLE, 0);
        
            thingy_under_discovery_conn_handle = 0xFFFF;
        }
    }
    
}

/**@brief Handles events coming from the LED Button central module.
 *
 * @param[in] p_lbs_c     The instance of LBS_C that triggered the event.
 * @param[in] p_lbs_c_evt The LBS_C event.
 */
static void thingy_uis_c_evt_handler(ble_thingy_uis_c_t * p_thingy_uis_c, ble_thingy_uis_c_evt_t * p_thingy_uis_c_evt)
{
    switch (p_thingy_uis_c_evt->evt_type)
    {
        case BLE_LBS_C_EVT_DISCOVERY_COMPLETE:
            NRF_LOG_INFO("UIS service discovered");
            thingy_service_discovered(THINGY_SERVICE_MASK_UIS);
            break; // BLE_LBS_C_EVT_DISCOVERY_COMPLETE

        case BLE_LBS_C_EVT_BUTTON_NOTIFICATION:
            NRF_LOG_INFO("Button pressed");
            if(p_thingy_uis_c_evt->params.button.button_state)
            {
                for(int i = 0; i < PONG_NUM_PLAYERS; i++)
                {
                    if(&m_thingy_uis_c[i] == p_thingy_uis_c)
                    {
                        app_pong_get_controller(i)->button_pressed = true;
                        break;
                    }
                }
            }
            break; // BLE_LBS_C_EVT_BUTTON_NOTIFICATION   */

        default:
            // No implementation needed.
            break;
    }
}
    
static void thingy_tms_c_evt_handler(ble_thingy_tms_c_t * p_thingy_tms_c, ble_thingy_tms_c_evt_t * p_thingy_tms_c_evt)  
{
    switch (p_thingy_tms_c_evt->evt_type)
    {
        case BLE_THINGY_TMS_C_EVT_DISCOVERY_COMPLETE:
            NRF_LOG_INFO("TMS service discovered");
            thingy_service_discovered(THINGY_SERVICE_MASK_TMS);
            break;

        case BLE_THINGY_TMS_C_EVT_EULER_NOTIFICATION:
            {
                uint32_t paddle_percentage = 0xFFFF;
                int32_t euler_roll_degrees;
                ble_thingy_tms_euler_t *euler_data = &p_thingy_tms_c_evt->params.euler;
                euler_roll_degrees = euler_data->roll / 0xFFFF;
                if(euler_roll_degrees < 60 && euler_roll_degrees > -60)
                {
                    paddle_percentage = (euler_roll_degrees + 60) * 100 / 120;
                }
                else if(euler_roll_degrees < -120)
                {
                    paddle_percentage = (-120 - euler_roll_degrees) * 50 / 60;
                }
                else if(euler_roll_degrees > 120)
                {
                    paddle_percentage = (180 - euler_roll_degrees) * 50 / 60 + 50;
                }
                else if(euler_roll_degrees < 0) paddle_percentage = 0;
                else paddle_percentage = 100;

                for(int i = 0; i < PONG_NUM_PLAYERS; i++)
                {
                    if(&m_thingy_tms_c[i] == p_thingy_tms_c)
                    {
                        uint32_t new_paddle_x = paddle_percentage * LEVEL_SIZE_Y / 100;
                        app_pong_get_controller(i)->paddle_x_delta = new_paddle_x - app_pong_get_controller(i)->paddle_x;
                        app_pong_get_controller(i)->paddle_x = new_paddle_x;
                        break;
                    }
                }
                //app_pong_set_global_control_state(&m_pong_control_state);
                //NRF_LOG_INFO("euler %i, %i, %i", euler_data->roll / 1024 / 1024, euler_data->pitch / 1024 / 1024, euler_data->yaw / 1024 / 1024);
            }   
            break;

        default:
            break;
    }  
}
    
